app/views/rooms/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
                    <% if logged_in? %>
                        <%= User.find_by(id: room.owner).name %>

SELECT "rooms".* FROM "rooms"
---
<script type="text/javascript">
    $('.document').ready(function () {
        $("#trash").attr("disabled", true);

        ["#trash"].forEach((value) => {
            let button_id = $(value);
            let href = button_id.attr('href');
            button_id.on('click', (event) => {
                let newHref = href + '?'
                $('.checkbox_room').each(function () {
                    if ($(this).prop('checked') == true) {
                        newHref += 'room_check%5B%5D=' + $(this).val() + '&'
                    }
                });
            button_id.attr('href', newHref)
            });
        })



        $('#checkBoxAll').click(function () {
            if ($(this).is(":checked"))