app/controllers/rooms_controller.rb

  def index
  	@rooms = Room.all
---
SELECT "rooms".* FROM "rooms"

   def show
    @room = Room.find(params[:id])
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def new
  	@room = Room.new
  	@room.owner = current_user.id
  	@room.name = 'Room_'+Room.maximum(:id).to_i.next.to_s
  	@room.save
---
SELECT MAX("rooms"."id") FROM "rooms"
INSERT INTO "rooms" ("name", "owner", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Room_1"], ["owner", "silent"], ["created_at", "2018-08-01 15:32:54.899047"], ["updated_at", "2018-08-01 15:32:54.899047"]]

  def delete_rooms
    if params[:room_check]
      Room.where(id: params[:room_check]).destroy_all
---
DELETE FROM "rooms" WHERE "rooms"."id" = ?  [["id", 4]]
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" IN (?, ?, ?, ?, ?)  [["id", 4], ["id", 5], ["id", 6], ["id", 7], ["id", 8]]