app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."activated" = ? LIMIT ? OFFSET ?  [["activated", 1], ["LIMIT", 30], ["OFFSET", 0]]
---
  def index
    @users = User.where(activated: FILL_IN).paginate(page: params[:page])

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "activation_digest") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)    # Not the final implementation!
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "silent-man"], ["updated_at", "2018-08-01 16:30:28.159631"], ["id", 2]]
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?, ?)  [["id", 13], ["id", 14], ["id", 15]]
---
  def delete_users
    if params[:user_check]
      User.where(id: params[:user_check]).destroy_all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "ban" = 1 WHERE "users"."id" = ?  [["id", 6]]
---
  def ban_users
    if params[:user_check]
      User.where(id: params[:user_check]).update_all(ban:true)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "ban" = 0 WHERE "users"."id" = ?  [["id", 6]]
---
  def unban_users
    if params[:user_check]
      User.where(id: params[:user_check]).update_all(ban:false)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def correct_user
      @user = User.find(params[:id])